---
kind: enumMember
id: F:Autodesk.Revit.DB.TransactionStatus.Error
enum: Autodesk.Revit.DB.TransactionStatus
zh: 错误、报错
source: html/29b9a7a8-6754-8310-e063-622b569bb6d5.htm
---
# Autodesk.Revit.DB.TransactionStatus.Error

**中文**: 错误、报错

error while committing or rolling back